backend/tests/load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    - duration: 120
      arrivalRate: 100
      name: "Peak load"
  processor: "./load-test-helpers.js"

scenarios:
  - name: "Create and Visit URL"
    flow:
      - post:
          url: "/api/shorten"
          json:
            url: "https://example.com/{{ $randomNumber() }}"
            keywords: ["test", "load"]
          capture:
            - json: "$.data.slug"
              as: "slug"
      - think: 2
      - get:
          url: "/{{ slug }}"
          
  - name: "Visit existing URLs"
    weight: 3
    flow:
      - get:
          url: "/test.link.{{ $randomNumber(1000, 9999) }}"
          
  - name: "Get analytics"
    weight: 1
    flow:
      - get:
          url: "/api/analytics/summary"
          headers:
            Authorization: "Bearer {{ authToken }}"